#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Есть значение радиуса круга
radius = 42
# Выведите на консоль значение прощади этого круга с точностю до 4-х знаков после запятой

pi = 3.1415926
square = round(pi * radius ** 2, 4)
print(square)

# Далее, пусть есть координаты точки
point = (23, 34)
# где 23 - координата х, 34 - координата у
# Если точка point лежит внутри того самого круга (radius = 42), то выведите на консоль True,
# Или False, если точка лежит вовне круга.

distant = ((point[0] - 0) ** 2 + (point[1] - 0) ** 2) ** 0.5
print(radius > distant)

# Аналогично для другой точки
point_2 = (30, 30)
# Если точка point_2 лежит внутри круга (radius = 42), то выведите на консоль True,
# Или False, если точка лежит вовне круга.
distant = ((point_2[0] - 0) ** 2 + (point_2[1] - 0) ** 2) ** 0.5
print(radius > distant)

# Пример вывода на консоль:
#
# 77777.7777
# False
# False


