# -*- coding: utf-8 -*-

# Игра «Быки и коровы»
# https://goo.gl/Go2mb9
#
# Правила:
# Компьютер загадывает четырехзначное число, все цифры которого различны
# (первая цифра числа отлична от нуля). Игроку необходимо разгадать задуманное число.
# Игрок вводит четырехзначное число c неповторяющимися цифрами,
# компьютер сообщают о количестве «быков» и «коров» в названном числе
# «бык» — цифра есть в записи задуманного числа и стоит в той же позиции,
#       что и в задуманном числе
# «корова» — цифра есть в записи задуманного числа, но не стоит в той же позиции,
#       что и в задуманном числе
#
# Например, если задумано число 3275 и названо число 1234,
# получаем в названном числе одного «быка» и одну «корову».
# Очевидно, что число отгадано в том случае, если имеем 4 «быка».
#
# Формат ответа компьютера
# > быки - 1, коровы - 1


# Составить отдельный модуль mastermind_engine, реализующий функциональность игры.
# В этом модуле нужно реализовать функции:
#   загадать_число()
#   проверить_число(NN) - возвращает словарь {'bulls': N, 'cows': N}
# Загаданное число хранить в глобальной переменной.
# Обратите внимание, что строки - это список символов.
#
# В текущем модуле (lesson_006/01_mastermind.py) реализовать логику работы с пользователем:
#   модуль движка загадывает число
#   в цикле, пока число не отгадано
#       у пользователя запрашивается вариант числа
#       модуль движка проверяет число и выдает быков/коров
#       результат быков/коров выводится на консоль
#  когда игрок угадал таки число - показать количество ходов и вопрос "Хотите еще партию?"
#
# При написании кода учитывайте, что движок игры никак не должен взаимодействовать с пользователем.
# Все общение с пользователем делать в текущем модуле. Представьте, что движок игры могут использовать
# разные клиенты - веб, чатбот, приложение, етс - они знают как спрашивать и отвечать пользователю.
# Движок игры реализует только саму функциональность игры.
# Это пример применения SOLID принципа (см https://goo.gl/GFMoaI) в архитектуре программ.
# Точнее, в этом случае важен принцип единственной ответственности - https://goo.gl/rYb3hT

import mastermind_engine as engine
from termcolor import cprint, colored


while True:
    print('Начинаем игру! Компьютер загадал число')
    engine.save_hidden_number()
    number_of_attempts = 0
    while True:
        input_from_user = input('Введите число ')
        if engine.check_the_input_and_save(input_from_user):
            number_of_attempts += 1
            compare_result = engine.compare_user_number_with_hidden_one()
            if engine.mach(compare_result):
                cprint('Победа! Число угадано! Число попыток: ', on_color='on_magenta', end='')
                cprint(str(number_of_attempts), on_color='on_magenta')
                break
            else:
                cprint('Результат: ', color='green', end='')
                cprint(compare_result, color='yellow')
                cprint('Попробуйте еще раз. Уже сделано попыток: ', color='green', end='')
                cprint(str(number_of_attempts), color='yellow')

    end_yet = input('Если хотите еще одну игру, введите "Да" ')
    if end_yet != 'Да':
        cprint('Всего вам хорошего!', color='magenta')
        break
