from random import randint

# Доработать практическую часть урока lesson_007/python_snippets/08_practice.py

# Необходимо создать класс кота. У кота есть аттрибуты - сытость и дом (в котором он живет).
# Кот живет с человеком в доме.
# Для кота дом характеризируется - миской для еды и грязью.
# Изначально в доме нет еды для кота и нет грязи.

# Доработать класс человека, добавив методы
#   подобрать кота - у кота появляется дом.
#   купить коту еды - кошачья еда в доме увеличивается на 50, деньги уменьшаются на 50.
#   убраться в доме - степень грязи в доме уменьшается на 100, сытость у человека уменьшается на 20.
# Увеличить кол-во зарабатываемых человеком денег до 150 (он выучил пайтон и устроился на хорошую работу :)

# Кот может есть, спать и драть обои - необходимо реализовать соответствующие методы.
# Когда кот спит - сытость уменьшается на 10
# Когда кот ест - сытость увеличивается на 20, кошачья еда в доме уменьшается на 10.
# Когда кот дерет обои - сытость уменьшается на 10, степень грязи в доме увеличивается на 5
# Если степень сытости < 0, кот умирает.
# Так же надо реализовать метод "действуй" для кота, в котором он принимает решение
# что будет делать сегодня

# Человеку и коту надо вместе прожить 365 дней.

# TODO здесь ваш код


class Street:

    def __init__(self):
        self.name = 'Улица'
        self.dirty = 1000

    def __str__(self):
        return 'Это суровая улица'


class House:

    def __init__(self):
        self.name = 'Домище'
        self.food = 0
        self.food_for_cat = 0
        self.dirty = 0
        self.money = 0

    def __str__(self):
        return 'Дом: еда - {}, еда для кошек - {}, грязь - {}, деньги - {}'.format(
            self.food, self.food_for_cat, self.dirty, self.money)


class Cat:

    def __init__(self, name):
        self.name = name
        self.home = Street()
        self.satiety = 30  # сытость
        self.drowsiness = 30  # сонливость
        self.happiness = 0

    def __str__(self):
        return 'Кот {} в доме {}: сытость {}, сонливость {}, счастье {}'.format(
            self.name, self.home.name, self.satiety, self.drowsiness, self.happiness)

    def make_a_mess(self):
        if type(self.home) is House:
            self.satiety -= 20
            self.drowsiness += 20
            self.home.dirty += 20
        else:
            print('Кот {} еще живет на улице'.format(self.name))
            return

    def act(self):
        if self.satiety <= 0:
            print('Кот {} умер с голоду'.format(self.name))
            return


SweetHome = House()
Bubble = Cat('Бублик')
Bubble.make_a_mess()
Bubble.home = SweetHome
Bubble.make_a_mess()
print(Bubble)
print(SweetHome)

# Усложненное задание (делать по желанию)
# Создать несколько (2-3) котов и подселить их в дом к человеку.
# Им всем вместе так же надо прожить 365 дней.

# (Можно определить критическое количество котов, которое может прокормить человек...)
