# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['Ivan', 'Olga', 'Korna', 'Kira']


# список списков приблизителного роста членов вашей семьи
my_family_height = [
    # ['имя', рост],
    [my_family[0], 179],
    [my_family[1], 165],
    [my_family[2], 20],
    [my_family[3], 22],
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
print('Рост первого', my_family_height[0][1])

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
print('Сумма ростов',
      my_family_height[0][1] +
      my_family_height[1][1] +
      my_family_height[2][1] +
      my_family_height[3][1]
      )