# (цикл while)

# Ежемесячная стипендия студента составляет educational_grant руб., а расходы на проживание превышают стипендию
# и составляют expenses руб. в месяц. Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Составьте программу расчета суммы денег, которую необходимо единовременно попросить у родителей,
# чтобы можно было прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
# Формат вывода:
#   Студенту надо попросить ХХХ.ХХ рублей

educational_grant, expenses = 10000, 12000

expenses_inf = expenses
expenses_summ = 0
i = 0
while i < 10:
    expenses_summ += expenses_inf - educational_grant
    print(i, 'мес. Расход:', round(expenses_inf, 2), ';      После стипендии долг:', round(expenses_summ, 2))
    expenses_inf += expenses_inf * 0.03
    i += 1
print('На весь учебный год необходимо взять у родителей:', round(expenses_summ, 2))

